W7D3/music_app_specs/musicapp/app/models/user.rb

INSERT INTO "users" ("email", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["email", "wierdo@gmail.com"], ["password_digest", "$2a$12$uDfclXHDduLbhnZYH8joEOTADzeO3whwS3GR6AMNNiYaJ62LVT2/e"], ["session_token", "Bc_rldaYUpBIfLCPledjHA"]]
UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "n8MOXE8kCMs3OqwXfR7-UA"], ["id", 6]]
---
  def reset_session_token!
    self.session_token = SecureRandom::urlsafe_base64
    self.save!