W7D3/music_app_specs/musicapp/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["email", "stew@me.com"], ["password_digest", "$2a$12$kdLfsxcfOgHfzy/78y17AuKGZYYH1/B1w4HFQ1y1IdktZVAQf0aPC"], ["session_token", "t44LStl7dJk-i4ZdBcYaOw"]]
---
  def create
    user = User.new(user_params)

    if user.save